## Step 1. Import Libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

## Step 2. import file

In [ ]:
df=pd.read_csv(url, sep='\t')

## Step 3. View top 5 rows

In [7]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 4. What is the number of observations in the dataset?

In [10]:
df.shape

(4622, 5)

## Step 5. Print the name of all the columns.

In [11]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

## Step 6. What is the number of columns

In [12]:
df.shape[1]

5

## Step 7. How is the dataset indexed?

In [13]:
df.index

RangeIndex(start=0, stop=4622, step=1)

## Step 8. Which was the most-ordered item?

In [21]:
item_ordered=df.groupby(['item_name']).agg({'quantity':'sum'})

In [27]:
item_ordered.sort_values(by='quantity', ascending=False)[:1]

              quantity
item_name
Chicken Bowl       761

In [28]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 9. What was the most ordered item in the choice_description column?

In [34]:
choice_desc=df.groupby(['choice_description']).agg({'quantity':'sum'})

In [36]:
choice_desc.sort_values(by='quantity', ascending=False)[:1]

                    quantity
choice_description
[Diet Coke]              159

## Step 10. How many items were orderd in total?

In [38]:
df.quantity.sum()

4972

## Step 11. Turn the item price into a float

In [56]:
df['item_price'].dtypes

dtype('float64')

In [53]:
df['item_price']=df.item_price.str.slice(1).astype('float')

In [54]:
df.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

## Step 12. How much was the revenue for the period in the dataset?

In [62]:
total_item_price=(df.quantity*df.item_price).sum()

In [63]:
print('Total revenue was $',total_item_price)

Total revenue was $ 39237.02

## Step 13. How many orders were made in the period?

In [84]:
order_made=df.order_id.nunique()
print('Total orders in the period are:', order_made)

Total orders in the period are: 1834

## Step 14. What is the average revenue amount per order?

In [85]:
total_item_price/order_made

21.39423118865867

## Step 15. How many different items are sold?

In [87]:
df.item_name.nunique()

50